ERP_Управление_предприятием_2_демо.УТЗ_ПутевыеЛисты/src/Documents/УТЗ_ПЛ_СписаниеТоплива/УТЗ_ПЛ_СписаниеТоплива.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>УТЗ_ПЛ_СписаниеТоплива</name>
  <registerRecords>InformationRegister.УТЗ_ПЛ_ЗаблокированныеДокументы</registerRecords>
  <registerRecords>AccumulationRegister.УТЗ_ПЛ_ТопливоКСписанию</registerRecords>
  <attributes>
    <name>ВидЦены</name>
    <type>
      <types>CatalogRef.ВидыЦен</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>НаправлениеДеятельности</name>
    <type>
      <types>CatalogRef.НаправленияДеятельности</types>
    </type>
  </attributes>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Подразделение</name>
    <type>
      <types>CatalogRef.СтруктураПредприятия</types>
    </type>
  </attributes>
  <attributes>
    <name>ПотреблениеДляДеятельности</name>
    <type>
      <types>EnumRef.ТипыНалогообложенияНДС</types>
    </type>
  </attributes>
  <attributes>
    <name>Склад</name>
    <type>
      <types>CatalogRef.Склады</types>
    </type>
  </attributes>
  <attributes>
    <name>ХозяйственнаяОперация</name>
    <type>
      <types>EnumRef.ХозяйственныеОперации</types>
    </type>
  </attributes>
  <attributes>
    <name>ДокументВнутреннееПотребление</name>
    <type>
      <types>DocumentRef.ВнутреннееПотребление</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Товары</name>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СтатьяСписания</name>
      <type>
        <types>ChartOfCharacteristicTypesRef.СтатьиРасходов</types>
        <types>ChartOfCharacteristicTypesRef.СтатьиАктивовПассивов</types>
      </type>
    </attributes>
    <attributes>
      <name>ПутевойЛист</name>
      <type>
        <types>DocumentRef.УТЗ_ПЛ_ПутевойЛист</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

ERP_Управление_предприятием_2_демо.УТЗ_ПутевыеЛисты/src/AccumulationRegisters/УТЗ_ПЛ_ТопливоКСписанию/УТЗ_ПЛ_ТопливоКСписанию.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>УТЗ_ПЛ_ТопливоКСписанию</name>
  <resources>
    <name>КоличествоКСписанию</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>ДокументСписания</name>
    <type>
      <types>DocumentRef.УТЗ_ПЛ_ПутевойЛист</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Номенклатура</name>
    <type>
      <types>CatalogRef.Номенклатура</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Подразделение</name>
    <type>
      <types>CatalogRef.СтруктураПредприятия</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Склад</name>
    <type>
      <types>CatalogRef.Склады</types>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

ERP_Управление_предприятием_2_демо.УТЗ_ПутевыеЛисты/src/Enums/ХозяйственныеОперации/ХозяйственныеОперации.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension" extendedConfigurationObject="351b0c5b-74c3-4aaa-a93b-7246b941f797">
  <name>ХозяйственныеОперации</name>
  <objectBelonging>Adopted</objectBelonging>
  <enumValues extendedConfigurationObject="82e6dbf8-d7ba-4382-9880-9e83d175a158">
    <name>СписаниеТоваровПоТребованию</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
</mdclass:Enum>

ERP_Управление_предприятием_2_демо.УТЗ_ПутевыеЛисты/src/Documents/УТЗ_ПЛ_СписаниеТоплива/ObjectModule.bsl
#Область ОбработчикиСобытий

Процедура ОбработкаЗаполнения(ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка)
		
	Ответственный = Пользователи.ТекущийПользователь();
	Организация = УТЗ_ПЛ_Организации.СсылкаОрганизацииУТЗ();
	ХозяйственнаяОперация = Перечисления.ХозяйственныеОперации.СписаниеТоваровПоТребованию;
	
КонецПроцедуры

Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	
	Движения.УТЗ_ПЛ_ТопливоКСписанию.Записывать = Истина;
	Движения.УТЗ_ПЛ_ТопливоКСписанию.Записать();
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	УТЗ_ПЛ_СписаниеТопливаТовары.ПутевойЛист КАК ДокументСписания,
	|	УТЗ_ПЛ_СписаниеТопливаТовары.Номенклатура КАК Номенклатура,
	|	УТЗ_ПЛ_СписаниеТопливаТовары.Ссылка.Подразделение КАК Подразделение,
	|	УТЗ_ПЛ_СписаниеТопливаТовары.Ссылка.Склад КАК Склад,
	|	СУММА(УТЗ_ПЛ_СписаниеТопливаТовары.Количество) КАК КоличествоКСписанию
	|ПОМЕСТИТЬ ВТДанныеТЧ
	|ИЗ
	|	Документ.УТЗ_ПЛ_СписаниеТоплива.Товары КАК УТЗ_ПЛ_СписаниеТопливаТовары
	|ГДЕ
	|	УТЗ_ПЛ_СписаниеТопливаТовары.Ссылка = &Ссылка
	|
	|СГРУППИРОВАТЬ ПО
	|	УТЗ_ПЛ_СписаниеТопливаТовары.ПутевойЛист,
	|	УТЗ_ПЛ_СписаниеТопливаТовары.Номенклатура,
	|	УТЗ_ПЛ_СписаниеТопливаТовары.Ссылка.Подразделение,
	|	УТЗ_ПЛ_СписаниеТопливаТовары.Ссылка.Склад
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТДанныеТЧ.ДокументСписания КАК ДокументСписания,
	|	ВТДанныеТЧ.Номенклатура КАК Номенклатура,
	|	ВТДанныеТЧ.Подразделение КАК Подразделение,
	|	ВТДанныеТЧ.Склад КАК Склад,
	|	ВТДанныеТЧ.КоличествоКСписанию КАК КоличествоКСписанию,
	|	ЕСТЬNULL(УТЗ_ПЛ_ТопливоКСписаниюОстатки.КоличествоКСписаниюОстаток, 0) КАК ОстатокТоплива
	|ИЗ
	|	ВТДанныеТЧ КАК ВТДанныеТЧ
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.УТЗ_ПЛ_ТопливоКСписанию.Остатки(
	|				&ДатаАктуальности,
	|				Номенклатура В
	|					(ВЫБРАТЬ РАЗЛИЧНЫЕ
	|						ВТДанныеТЧ.Номенклатура КАК Номенклатура
	|					ИЗ
	|						ВТДанныеТЧ КАК ВТДанныеТЧ)) КАК УТЗ_ПЛ_ТопливоКСписаниюОстатки
	|		ПО ВТДанныеТЧ.Номенклатура = УТЗ_ПЛ_ТопливоКСписаниюОстатки.Номенклатура
	|			И ВТДанныеТЧ.Подразделение = УТЗ_ПЛ_ТопливоКСписаниюОстатки.Подразделение
	|			И ВТДанныеТЧ.Склад = УТЗ_ПЛ_ТопливоКСписаниюОстатки.Склад
	|			И ВТДанныеТЧ.ДокументСписания = УТЗ_ПЛ_ТопливоКСписаниюОстатки.ДокументСписания";
	
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	Запрос.УстановитьПараметр("ДатаАктуальности", Дата);
	
	Блокировка = Новый БлокировкаДанных;
	ЭлементБлокировки = Блокировка.Добавить("РегистрНакопления.УТЗ_ПЛ_ТопливоКСписанию");
	ЭлементБлокировки.ИсточникДанных = Товары;
	ЭлементБлокировки.ИспользоватьИзИсточникаДанных("Номенклатура", "Номенклатура");
	Блокировка.Заблокировать();
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Пока Выборка.Следующий() Цикл
		
		Если Выборка.КоличествоКСписанию > Выборка.ОстатокТоплива Тогда
			Отказ = Истина;
			ТекстСообщения = СтрШаблон("Недостаточно топлива для списания. Доступно к списанию %1, предлагается списать %2"
			, Выборка.ОстатокТоплива
			, Выборка.КоличествоКСписанию);
			ОбщегоНазначения.СообщитьПользователю(ТекстСообщения);
		КонецЕсли;
		
		Движение = Движения.УТЗ_ПЛ_ТопливоКСписанию.ДобавитьРасход();
		ЗаполнитьЗначенияСвойств(Движение, Выборка);
		Движение.Период = Дата;
		
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти
